In [1]:
import pandas as pd

In [2]:
mylist1 = [11,22,33,'abc','def',44]

In [3]:
type(mylist1)

list

In [4]:
ps1 =pd.Series(mylist1) # for 1D mostly

In [121]:
a =ps1.index # indexes doesnt appear for default indexes.but for userdefined indexes it works.
a

RangeIndex(start=0, stop=6, step=1)

In [122]:

for i in a:
    print(i) # it comes only when we use range

0
1
2
3
4
5

In [5]:
type(ps1)

pandas.core.series.Series

In [6]:
ps1

0     11
1     22
2     33
3    abc
4    def
5     44
dtype: object

In [7]:
ps2 = pd.Series(mylist1,index =['r0','r1','r2','r3','r4','r5'])

In [8]:
ps2

r0     11
r1     22
r2     33
r3    abc
r4    def
r5     44
dtype: object

In [9]:
ps2.values

array([11, 22, 33, 'abc', 'def', 44], dtype=object)

In [10]:
x =ps2.index
x

Index(['r0', 'r1', 'r2', 'r3', 'r4', 'r5'], dtype='object')

In [11]:
dir(ps2)

['T',
 '_AXIS_ALIASES',
 '_AXIS_IALIASES',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_AXIS_SLICEMAP',
 '__abs__',
 '__add__',
 '__and__',
 '__array__',
 '__array_prepare__',
 '__array_priority__',
 '__array_wrap__',
 '__bool__',
 '__bytes__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__float__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__int__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__long__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__unicode__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_only_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_binop',
 '_box_item_values',
 '_builtin_table',
 '_can_hold_na',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_percentile',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_dict_for_slice',
 '_construct_axes_dict_from',
 '_construct_axes_from_arguments',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_create_indexer',
 '_cython_table',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_expand_axes',
 '_find_valid_index',
 '_formatting_values',
 '_from_axes',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_get_values',
 '_get_values_tuple',
 '_get_with',
 '_gotitem',
 '_iget_item_cache',
 '_index',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_init_dict',
 '_init_mgr',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_copy',
 '_is_cython_func',
 '_is_datelike_mixed_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_numeric_mixed_type',
 '_is_view',
 '_ix',
 '_ixs',
 '_map_values',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_ndarray_values',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_axis',
 '_reindex_indexer',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_repr_data_resource_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_set_labels',
 '_set_name',
 '_set_subtyp',
 '_set_value',
 '_set_values',
 '_set_with',
 '_set_with_engine',
 '_setup_axes',
 '_shallow_copy',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_take',
 '_to_dict_of_blocks',
 '_try_aggregate_string_function',
 '_typ',
 '_unpickle_series_compat',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 '_xs',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'argmax',
 'argmin',
 'argsort',
 'as_matrix',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'autocorr',
 'axes',
 'base',
 'between',
 'between_time',
 'bfill',
 'bool',
 'clip',
 'clip_lower',
 'clip_upper',
 'combine',
 'combine_first',
 'compound',
 'compress',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'data',
 'describe',
 'diff',
 'div',
 'divide',
 'divmod',
 'dot',
 'drop',
 'drop_duplicates',
 'dropna',
 'dtype',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'factorize',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'flags',
 'floordiv',
 'from_array',
 'ftype',
 'ftypes',
 'ge',
 'get',
 'get_dtype_counts',
 'get_ftype_counts',
 'get_values',
 'groupby',
 'gt',
 'hasnans',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'imag',
 'index',
 'infer_objects',
 'interpolate',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'items',
 'itemsize',
 'iteritems',
 'ix',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mad',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'name',
 'nbytes',
 'ndim',
 'ne',
 'nlargest',
 'nonzero',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'ptp',
 'put',
 'quantile',
 'r0',
 'r1',
 'r2',
 'r3',
 'r4',
 'r5',
 'radd',
 'rank',
 'ravel',
 'rdiv',
 'real',
 'reindex',
 'reindex_axis',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'repeat',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'searchsorted',
 'select',
 'sem',
 'set_axis',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'std',
 'str',
 'strides',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dense',
 'to_dict',
 'to_excel',
 'to_frame',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_msgpack',
 'to_period',
 'to_pickle',
 'to_sparse',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'tolist',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unique',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'view',
 'where',
 'xs']

In [12]:
print(type(ps2))
type(x)

<class 'pandas.core.series.Series'>

pandas.core.indexes.base.Index

In [13]:
#Iterator---one time use objects filter,map
#iterable ---list , which can iterate in a loop

In [14]:
ps2['r0']

11

In [15]:
ps2[2:5]

r2     33
r3    abc
r4    def
dtype: object

In [16]:
ps2['r2':'r5']

r2     33
r3    abc
r4    def
r5     44
dtype: object

In [17]:
ps2[['r2','r5','r0']]  # vector based index

r2    33
r5    44
r0    11
dtype: object

In [18]:
ps2

r0     11
r1     22
r2     33
r3    abc
r4    def
r5     44
dtype: object

In [19]:
ps2[:3]+5# broadcasting

r0    16
r1    27
r2    38
dtype: object

In [20]:
ps2[:]*5

r0                 55
r1                110
r2                165
r3    abcabcabcabcabc
r4    defdefdefdefdef
r5                220
dtype: object

In [21]:
ps2[ps2!=33]

r0     11
r1     22
r3    abc
r4    def
r5     44
dtype: object

In [22]:
mask = ps2!=33
ps2[mask]

r0     11
r1     22
r3    abc
r4    def
r5     44
dtype: object

In [23]:
myd1 = {'Tcs':3000,'RTL':2000,'ONGC':5000,'BIRLA':100}

In [24]:
myd1

{'Tcs': 3000, 'RTL': 2000, 'ONGC': 5000, 'BIRLA': 100}

In [25]:
ps3 = pd.Series(myd1)
ps3  # keys bacame indices,col became values

Tcs      3000
RTL      2000
ONGC     5000
BIRLA     100
dtype: int64

In [26]:
ps3[2:4]

ONGC     5000
BIRLA     100
dtype: int64

In [27]:
ps3.index

Index(['Tcs', 'RTL', 'ONGC', 'BIRLA'], dtype='object')

In [28]:
ps3.values

array([3000, 2000, 5000,  100], dtype=int64)

In [29]:
ps3.ndim

1

In [30]:
ps3.shape

(4,)

In [31]:
type(ps3)

pandas.core.series.Series

In [32]:
myd2 = {'c0':[1,2,3,4,5],'c1':[11,22,33,44,55],'c2':[111,222,333,444,555]}
df1 = pd.DataFrame(myd2)
df1

   c0  c1   c2
0   1  11  111
1   2  22  222
2   3  33  333
3   4  44  444
4   5  55  555

In [33]:
myindex= ['r0', 'r1', 'r2', 'r3', 'r4']

In [34]:
df2 = pd.DataFrame(myd2,index =myindex)

In [35]:
df2

    c0  c1   c2
r0   1  11  111
r1   2  22  222
r2   3  33  333
r3   4  44  444
r4   5  55  555

In [36]:
type(df2)

pandas.core.frame.DataFrame

In [37]:
type(df2['c0'])

pandas.core.series.Series

In [38]:
df2.index

Index(['r0', 'r1', 'r2', 'r3', 'r4'], dtype='object')

In [39]:
df2.columns

Index(['c0', 'c1', 'c2'], dtype='object')

In [40]:
n1 = df2.values
n1

array([[  1,  11, 111],
       [  2,  22, 222],
       [  3,  33, 333],
       [  4,  44, 444],
       [  5,  55, 555]], dtype=int64)

In [41]:
type(n1)

numpy.ndarray

In [42]:
n1.shape

(5, 3)

In [43]:
df2.shape

(5, 3)

In [44]:
df2.ndim

2

In [45]:
df2 = pd.DataFrame(myd2,index =myindex,columns = ['c1','c0','c2'])  # 
df2

    c1  c0   c2
r0  11   1  111
r1  22   2  222
r2  33   3  333
r3  44   4  444
r4  55   5  555

In [46]:
df2.columns

Index(['c1', 'c0', 'c2'], dtype='object')

In [47]:
df3 = pd.read_csv('C:/Users/SRK/Desktop/siva_python/Day_6_numpy_pandas/profit1.csv')
df3

          Vol  Rev  Exp Catg  EmpCnt   HQ
HCL       931  863  605  Pub    1935  NCR
MRF       992  821  665  Pub    1154  Che
ISROACL   931  881  650  Gov    1361  Blr
Reliance  899  217  674  Pub    1443  Mum
BCCI      925  839  615  Pvt     154  Mum
Birla     900  874  676  Pub    1379  Kol
Flipkart  966  805  695  Pvt     119  Blr
Apollo    966  863  608  Pub    1656  Che
IR        954  833  609  Gov   13023  NCR

In [48]:
df3.index

Index(['HCL', 'MRF', 'ISROACL', 'Reliance', 'BCCI', 'Birla', 'Flipkart',
       'Apollo', 'IR'],
      dtype='object')

In [49]:
df3.shape

(9, 6)

In [50]:
df3.head(3)# default 5

         Vol  Rev  Exp Catg  EmpCnt   HQ
HCL      931  863  605  Pub    1935  NCR
MRF      992  821  665  Pub    1154  Che
ISROACL  931  881  650  Gov    1361  Blr

In [51]:
df3.head()

          Vol  Rev  Exp Catg  EmpCnt   HQ
HCL       931  863  605  Pub    1935  NCR
MRF       992  821  665  Pub    1154  Che
ISROACL   931  881  650  Gov    1361  Blr
Reliance  899  217  674  Pub    1443  Mum
BCCI      925  839  615  Pvt     154  Mum

In [52]:
df3.tail()

          Vol  Rev  Exp Catg  EmpCnt   HQ
BCCI      925  839  615  Pvt     154  Mum
Birla     900  874  676  Pub    1379  Kol
Flipkart  966  805  695  Pvt     119  Blr
Apollo    966  863  608  Pub    1656  Che
IR        954  833  609  Gov   13023  NCR

In [53]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, HCL to IR
Data columns (total 6 columns):
Vol       9 non-null int64
Rev       9 non-null int64
Exp       9 non-null int64
Catg      9 non-null object
EmpCnt    9 non-null int64
HQ        9 non-null object
dtypes: int64(4), object(2)
memory usage: 504.0+ bytes

In [54]:
df3.describe()

              Vol         Rev         Exp        EmpCnt
count    9.000000    9.000000    9.000000      9.000000
mean   940.444444  777.333333  644.111111   2469.333333
std     31.460734  211.635300   35.151260   4006.439036
min    899.000000  217.000000  605.000000    119.000000
25%    925.000000  821.000000  609.000000   1154.000000
50%    931.000000  839.000000  650.000000   1379.000000
75%    966.000000  863.000000  674.000000   1656.000000
max    992.000000  881.000000  695.000000  13023.000000

In [55]:
df3.count() # no.o ele in eac col

Vol       9
Rev       9
Exp       9
Catg      9
EmpCnt    9
HQ        9
dtype: int64

In [56]:
df3['HQ'].count()

9

In [57]:
df3.HQ.count()

9

In [58]:
df3['HQ'].value_counts()# frequecy of ele

Mum    2
Che    2
NCR    2
Blr    2
Kol    1
Name: HQ, dtype: int64

In [60]:
#df3.value_counts() # it only works for series



'''
---------------------------------------------------------------------------
AttributeError                            Traceback (most recent call last)
<ipython-input-60-e38bb0900834> in <module>
----> 1 df3.value_counts() # it only works for series

~\Anaconda3\lib\site-packages\pandas\core\generic.py in __getattr__(self, name)
   4374             if self._info_axis._can_hold_identifiers_and_holds_name(name):
   4375                 return self[name]
-> 4376             return object.__getattribute__(self, name)
   4377 
   4378     def __setattr__(self, name, value):

AttributeError: 'DataFrame' object has no attribute 'value_counts'





'''

"\n---------------------------------------------------------------------------\nAttributeError                            Traceback (most recent call last)\n<ipython-input-60-e38bb0900834> in <module>\n----> 1 df3.value_counts() # it only works for series\n\n~\\Anaconda3\\lib\\site-packages\\pandas\\core\\generic.py in __getattr__(self, name)\n   4374             if self._info_axis._can_hold_identifiers_and_holds_name(name):\n   4375                 return self[name]\n-> 4376             return object.__getattribute__(self, name)\n   4377 \n   4378     def __setattr__(self, name, value):\n\nAttributeError: 'DataFrame' object has no attribute 'value_counts'\n\n\n\n\n\n"

In [61]:
df3['Catg']

HCL         Pub
MRF         Pub
ISROACL     Gov
Reliance    Pub
BCCI        Pvt
Birla       Pub
Flipkart    Pvt
Apollo      Pub
IR          Gov
Name: Catg, dtype: object

In [62]:
df3.Catg

HCL         Pub
MRF         Pub
ISROACL     Gov
Reliance    Pub
BCCI        Pvt
Birla       Pub
Flipkart    Pvt
Apollo      Pub
IR          Gov
Name: Catg, dtype: object

In [63]:
df3[['Catg','HQ']]

         Catg   HQ
HCL       Pub  NCR
MRF       Pub  Che
ISROACL   Gov  Blr
Reliance  Pub  Mum
BCCI      Pvt  Mum
Birla     Pub  Kol
Flipkart  Pvt  Blr
Apollo    Pub  Che
IR        Gov  NCR

In [64]:
df3.iloc[0]#index loc

Vol        931
Rev        863
Exp        605
Catg       Pub
EmpCnt    1935
HQ         NCR
Name: HCL, dtype: object

In [65]:
df3.iloc[0,1]

863

In [66]:
df3.iloc[1:5,2:5]

          Exp Catg  EmpCnt
MRF       665  Pub    1154
ISROACL   650  Gov    1361
Reliance  674  Pub    1443
BCCI      615  Pvt     154

In [67]:
df3.iloc[1:5,:5]

          Vol  Rev  Exp Catg  EmpCnt
MRF       992  821  665  Pub    1154
ISROACL   931  881  650  Gov    1361
Reliance  899  217  674  Pub    1443
BCCI      925  839  615  Pvt     154

In [68]:
df4 =df3.iloc[[1,4,3],[2,5,3]] # df.iloc[[rowvector],[colvector]]
df4

          Exp   HQ Catg
MRF       665  Che  Pub
BCCI      615  Mum  Pvt
Reliance  674  Mum  Pub

In [69]:
type(df4)

pandas.core.frame.DataFrame

In [70]:
df4.shape

(3, 3)

In [71]:
df3.iloc[2:5,[3,2,5]]

         Catg  Exp   HQ
ISROACL   Gov  650  Blr
Reliance  Pub  674  Mum
BCCI      Pvt  615  Mum

In [72]:
df3.iloc[::-1,[2,5,3]]

          Exp   HQ Catg
IR        609  NCR  Gov
Apollo    608  Che  Pub
Flipkart  695  Blr  Pvt
Birla     676  Kol  Pub
BCCI      615  Mum  Pvt
Reliance  674  Mum  Pub
ISROACL   650  Blr  Gov
MRF       665  Che  Pub
HCL       605  NCR  Pub

In [73]:
df3

          Vol  Rev  Exp Catg  EmpCnt   HQ
HCL       931  863  605  Pub    1935  NCR
MRF       992  821  665  Pub    1154  Che
ISROACL   931  881  650  Gov    1361  Blr
Reliance  899  217  674  Pub    1443  Mum
BCCI      925  839  615  Pvt     154  Mum
Birla     900  874  676  Pub    1379  Kol
Flipkart  966  805  695  Pvt     119  Blr
Apollo    966  863  608  Pub    1656  Che
IR        954  833  609  Gov   13023  NCR

In [74]:
df3.iloc[:4:-1]

          Vol  Rev  Exp Catg  EmpCnt   HQ
IR        954  833  609  Gov   13023  NCR
Apollo    966  863  608  Pub    1656  Che
Flipkart  966  805  695  Pvt     119  Blr
Birla     900  874  676  Pub    1379  Kol

In [75]:
df3.iloc[[2,4,3],2:5]

          Exp Catg  EmpCnt
ISROACL   650  Gov    1361
BCCI      615  Pvt     154
Reliance  674  Pub    1443

# label based ----LOC

In [76]:
df3.loc['MRF',"HQ"]

'Che'

In [77]:
df3.loc[["MRF","BCCI"],["HQ",'Catg',"Vol"]]

       HQ Catg  Vol
MRF   Che  Pub  992
BCCI  Mum  Pvt  925

In [78]:
df3.loc['MRF':'Apollo':2,"Rev":'Catg']

          Rev  Exp Catg
MRF       821  665  Pub
Reliance  217  674  Pub
Birla     874  676  Pub
Apollo    863  608  Pub

In [79]:
df3.loc[['MRF','Apollo'],["Rev",'Catg']]

        Rev Catg
MRF     821  Pub
Apollo  863  Pub

In [80]:
df3[df3.Catg =='Pub']

          Vol  Rev  Exp Catg  EmpCnt   HQ
HCL       931  863  605  Pub    1935  NCR
MRF       992  821  665  Pub    1154  Che
Reliance  899  217  674  Pub    1443  Mum
Birla     900  874  676  Pub    1379  Kol
Apollo    966  863  608  Pub    1656  Che

In [81]:
df3[(df3.HQ=="Che")& (df3.Catg=="Pub")]

        Vol  Rev  Exp Catg  EmpCnt   HQ
MRF     992  821  665  Pub    1154  Che
Apollo  966  863  608  Pub    1656  Che

In [82]:
df3.loc['HCL',"HQ"] ="Mum"
df3

          Vol  Rev  Exp Catg  EmpCnt   HQ
HCL       931  863  605  Pub    1935  Mum
MRF       992  821  665  Pub    1154  Che
ISROACL   931  881  650  Gov    1361  Blr
Reliance  899  217  674  Pub    1443  Mum
BCCI      925  839  615  Pvt     154  Mum
Birla     900  874  676  Pub    1379  Kol
Flipkart  966  805  695  Pvt     119  Blr
Apollo    966  863  608  Pub    1656  Che
IR        954  833  609  Gov   13023  NCR

In [83]:

df4 =pd.read_csv(r'C:/Users/SRK/Desktop/siva_python/Day_6_numpy_pandas/profit1.csv')
df4.sort_index()

          Vol  Rev  Exp Catg  EmpCnt   HQ
Apollo    966  863  608  Pub    1656  Che
BCCI      925  839  615  Pvt     154  Mum
Birla     900  874  676  Pub    1379  Kol
Flipkart  966  805  695  Pvt     119  Blr
HCL       931  863  605  Pub    1935  NCR
IR        954  833  609  Gov   13023  NCR
ISROACL   931  881  650  Gov    1361  Blr
MRF       992  821  665  Pub    1154  Che
Reliance  899  217  674  Pub    1443  Mum

In [84]:
ds1 =df4.sort_index(axis =1,ascending =False,inplace=True) 
print(ds1)
df4

None

          Vol  Rev   HQ  Exp  EmpCnt Catg
HCL       931  863  NCR  605    1935  Pub
MRF       992  821  Che  665    1154  Pub
ISROACL   931  881  Blr  650    1361  Gov
Reliance  899  217  Mum  674    1443  Pub
BCCI      925  839  Mum  615     154  Pvt
Birla     900  874  Kol  676    1379  Pub
Flipkart  966  805  Blr  695     119  Pvt
Apollo    966  863  Che  608    1656  Pub
IR        954  833  NCR  609   13023  Gov

In [86]:
#ds1.columns

# sort by values

In [87]:
df4

          Vol  Rev   HQ  Exp  EmpCnt Catg
HCL       931  863  NCR  605    1935  Pub
MRF       992  821  Che  665    1154  Pub
ISROACL   931  881  Blr  650    1361  Gov
Reliance  899  217  Mum  674    1443  Pub
BCCI      925  839  Mum  615     154  Pvt
Birla     900  874  Kol  676    1379  Pub
Flipkart  966  805  Blr  695     119  Pvt
Apollo    966  863  Che  608    1656  Pub
IR        954  833  NCR  609   13023  Gov

In [88]:
print(df4.sort_values(by ="Vol"))  #print(df4.sort_values(by ="Vol",inpace =True))  #

          Vol  Rev   HQ  Exp  EmpCnt Catg
Reliance  899  217  Mum  674    1443  Pub
Birla     900  874  Kol  676    1379  Pub
BCCI      925  839  Mum  615     154  Pvt
HCL       931  863  NCR  605    1935  Pub
ISROACL   931  881  Blr  650    1361  Gov
IR        954  833  NCR  609   13023  Gov
Flipkart  966  805  Blr  695     119  Pvt
Apollo    966  863  Che  608    1656  Pub
MRF       992  821  Che  665    1154  Pub

In [89]:
df5 = df4.drop(['HQ','Catg'],axis =1)
print(df5)
x = df5.sort_values(by ='HCL',axis =1)
print(x)

          Vol  Rev  Exp  EmpCnt
HCL       931  863  605    1935
MRF       992  821  665    1154
ISROACL   931  881  650    1361
Reliance  899  217  674    1443
BCCI      925  839  615     154
Birla     900  874  676    1379
Flipkart  966  805  695     119
Apollo    966  863  608    1656
IR        954  833  609   13023
          Exp  Rev  Vol  EmpCnt
HCL       605  863  931    1935
MRF       665  821  992    1154
ISROACL   650  881  931    1361
Reliance  674  217  899    1443
BCCI      615  839  925     154
Birla     676  874  900    1379
Flipkart  695  805  966     119
Apollo    608  863  966    1656
IR        609  833  954   13023

In [90]:
df5 = df4.iloc[:,[0,1,3,4]]
print(df5)
x = df5.sort_values(by ='HCL',axis =1)
print(x)

          Vol  Rev  Exp  EmpCnt
HCL       931  863  605    1935
MRF       992  821  665    1154
ISROACL   931  881  650    1361
Reliance  899  217  674    1443
BCCI      925  839  615     154
Birla     900  874  676    1379
Flipkart  966  805  695     119
Apollo    966  863  608    1656
IR        954  833  609   13023
          Exp  Rev  Vol  EmpCnt
HCL       605  863  931    1935
MRF       665  821  992    1154
ISROACL   650  881  931    1361
Reliance  674  217  899    1443
BCCI      615  839  925     154
Birla     676  874  900    1379
Flipkart  695  805  966     119
Apollo    608  863  966    1656
IR        609  833  954   13023

In [91]:
df5 = df4.iloc[:,[0,1,3,4]].sort_values(by ='HCL',axis =1)
print(df5)

          Exp  Rev  Vol  EmpCnt
HCL       605  863  931    1935
MRF       665  821  992    1154
ISROACL   650  881  931    1361
Reliance  674  217  899    1443
BCCI      615  839  925     154
Birla     676  874  900    1379
Flipkart  695  805  966     119
Apollo    608  863  966    1656
IR        609  833  954   13023

In [92]:
df4.sort_values(by =['Vol','EmpCnt'],ascending =[True,False])

          Vol  Rev   HQ  Exp  EmpCnt Catg
Reliance  899  217  Mum  674    1443  Pub
Birla     900  874  Kol  676    1379  Pub
BCCI      925  839  Mum  615     154  Pvt
HCL       931  863  NCR  605    1935  Pub
ISROACL   931  881  Blr  650    1361  Gov
IR        954  833  NCR  609   13023  Gov
Apollo    966  863  Che  608    1656  Pub
Flipkart  966  805  Blr  695     119  Pvt
MRF       992  821  Che  665    1154  Pub

In [93]:
df4.sort_values(by =['HQ','Catg'],ascending =[True,True])

          Vol  Rev   HQ  Exp  EmpCnt Catg
ISROACL   931  881  Blr  650    1361  Gov
Flipkart  966  805  Blr  695     119  Pvt
MRF       992  821  Che  665    1154  Pub
Apollo    966  863  Che  608    1656  Pub
Birla     900  874  Kol  676    1379  Pub
Reliance  899  217  Mum  674    1443  Pub
BCCI      925  839  Mum  615     154  Pvt
IR        954  833  NCR  609   13023  Gov
HCL       931  863  NCR  605    1935  Pub

In [94]:
df4.Vol.mean()

940.4444444444445

In [95]:
df4['Vol'].mean()

940.4444444444445

In [96]:
df4['Vol'].mode()

0    931
1    966
dtype: int64

In [97]:
df4['Vol'].median()

931.0

# Rank

In [98]:
df4 = pd.read_csv(r'C:/Users/SRK/Desktop/siva_python/Day_6_numpy_pandas/profit1.csv')
df4

          Vol  Rev  Exp Catg  EmpCnt   HQ
HCL       931  863  605  Pub    1935  NCR
MRF       992  821  665  Pub    1154  Che
ISROACL   931  881  650  Gov    1361  Blr
Reliance  899  217  674  Pub    1443  Mum
BCCI      925  839  615  Pvt     154  Mum
Birla     900  874  676  Pub    1379  Kol
Flipkart  966  805  695  Pvt     119  Blr
Apollo    966  863  608  Pub    1656  Che
IR        954  833  609  Gov   13023  NCR

In [99]:
df4['Vol'].rank(axis =0)

HCL         4.5
MRF         9.0
ISROACL     4.5
Reliance    1.0
BCCI        3.0
Birla       2.0
Flipkart    7.5
Apollo      7.5
IR          6.0
Name: Vol, dtype: float64

In [100]:
df4['min_rank']=df4['Vol'].rank(axis =0,method ='min',ascending =False)
df4

          Vol  Rev  Exp Catg  EmpCnt   HQ  min_rank
HCL       931  863  605  Pub    1935  NCR       5.0
MRF       992  821  665  Pub    1154  Che       1.0
ISROACL   931  881  650  Gov    1361  Blr       5.0
Reliance  899  217  674  Pub    1443  Mum       9.0
BCCI      925  839  615  Pvt     154  Mum       7.0
Birla     900  874  676  Pub    1379  Kol       8.0
Flipkart  966  805  695  Pvt     119  Blr       2.0
Apollo    966  863  608  Pub    1656  Che       2.0
IR        954  833  609  Gov   13023  NCR       4.0

In [101]:
df4['max_rank']=df4['Vol'].rank(axis =0,method ='max',ascending =False)
df4

          Vol  Rev  Exp Catg  EmpCnt   HQ  min_rank  max_rank
HCL       931  863  605  Pub    1935  NCR       5.0       6.0
MRF       992  821  665  Pub    1154  Che       1.0       1.0
ISROACL   931  881  650  Gov    1361  Blr       5.0       6.0
Reliance  899  217  674  Pub    1443  Mum       9.0       9.0
BCCI      925  839  615  Pvt     154  Mum       7.0       7.0
Birla     900  874  676  Pub    1379  Kol       8.0       8.0
Flipkart  966  805  695  Pvt     119  Blr       2.0       3.0
Apollo    966  863  608  Pub    1656  Che       2.0       3.0
IR        954  833  609  Gov   13023  NCR       4.0       4.0

In [102]:
df4['dense_rank']=df4['Vol'].rank(axis =0,method ='dense',ascending =False)
df4

          Vol  Rev  Exp Catg  EmpCnt   HQ  min_rank  max_rank  dense_rank
HCL       931  863  605  Pub    1935  NCR       5.0       6.0         4.0
MRF       992  821  665  Pub    1154  Che       1.0       1.0         1.0
ISROACL   931  881  650  Gov    1361  Blr       5.0       6.0         4.0
Reliance  899  217  674  Pub    1443  Mum       9.0       9.0         7.0
BCCI      925  839  615  Pvt     154  Mum       7.0       7.0         5.0
Birla     900  874  676  Pub    1379  Kol       8.0       8.0         6.0
Flipkart  966  805  695  Pvt     119  Blr       2.0       3.0         2.0
Apollo    966  863  608  Pub    1656  Che       2.0       3.0         2.0
IR        954  833  609  Gov   13023  NCR       4.0       4.0         3.0

In [103]:
import numpy as np
df5 =df4.drop(df4.select_dtypes(include = np.object),axis =1);print(df5)
(df5.loc[['HCL','Reliance']]).rank(axis =1)

          Vol  Rev  Exp  EmpCnt  min_rank  max_rank  dense_rank
HCL       931  863  605    1935       5.0       6.0         4.0
MRF       992  821  665    1154       1.0       1.0         1.0
ISROACL   931  881  650    1361       5.0       6.0         4.0
Reliance  899  217  674    1443       9.0       9.0         7.0
BCCI      925  839  615     154       7.0       7.0         5.0
Birla     900  874  676    1379       8.0       8.0         6.0
Flipkart  966  805  695     119       2.0       3.0         2.0
Apollo    966  863  608    1656       2.0       3.0         2.0
IR        954  833  609   13023       4.0       4.0         3.0

          Vol  Rev  Exp  EmpCnt  min_rank  max_rank  dense_rank
HCL       6.0  5.0  4.0     7.0       2.0       3.0         1.0
Reliance  6.0  4.0  5.0     7.0       2.5       2.5         1.0

In [104]:
df4.dtypes.tolist()

[dtype('int64'),
 dtype('int64'),
 dtype('int64'),
 dtype('O'),
 dtype('int64'),
 dtype('O'),
 dtype('float64'),
 dtype('float64'),
 dtype('float64')]

In [105]:
df4.dtypes

Vol             int64
Rev             int64
Exp             int64
Catg           object
EmpCnt          int64
HQ             object
min_rank      float64
max_rank      float64
dense_rank    float64
dtype: object

In [106]:
df6 =df4.transpose() #or df4.T

In [107]:
df6

             HCL   MRF ISROACL Reliance BCCI Birla Flipkart Apollo     IR
Vol          931   992     931      899  925   900      966    966    954
Rev          863   821     881      217  839   874      805    863    833
Exp          605   665     650      674  615   676      695    608    609
Catg         Pub   Pub     Gov      Pub  Pvt   Pub      Pvt    Pub    Gov
EmpCnt      1935  1154    1361     1443  154  1379      119   1656  13023
HQ           NCR   Che     Blr      Mum  Mum   Kol      Blr    Che    NCR
min_rank       5     1       5        9    7     8        2      2      4
max_rank       6     1       6        9    7     8        3      3      4
dense_rank     4     1       4        7    5     6        2      2      3

In [108]:
df6.rank(axis =1,method ='min')

            HCL  MRF  ISROACL  Reliance  BCCI  Birla  Flipkart  Apollo   IR
Vol         4.0  9.0      4.0       1.0   3.0    2.0       7.0     7.0  6.0
Rev         6.0  3.0      9.0       1.0   5.0    8.0       2.0     6.0  4.0
Exp         1.0  6.0      5.0       7.0   4.0    8.0       9.0     2.0  3.0
Catg        3.0  3.0      1.0       3.0   8.0    3.0       8.0     3.0  1.0
EmpCnt      8.0  3.0      4.0       6.0   2.0    5.0       1.0     7.0  9.0
HQ          8.0  3.0      1.0       6.0   6.0    5.0       1.0     3.0  8.0
min_rank    5.0  1.0      5.0       9.0   7.0    8.0       2.0     2.0  4.0
max_rank    5.0  1.0      5.0       9.0   7.0    8.0       2.0     2.0  4.0
dense_rank  5.0  1.0      5.0       9.0   7.0    8.0       2.0     2.0  4.0

In [109]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, HCL to IR
Data columns (total 9 columns):
Vol           9 non-null int64
Rev           9 non-null int64
Exp           9 non-null int64
Catg          9 non-null object
EmpCnt        9 non-null int64
HQ            9 non-null object
min_rank      9 non-null float64
max_rank      9 non-null float64
dense_rank    9 non-null float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.0+ KB

In [110]:
df4.rank(axis=0,numeric_only=True)
#print(df4)

          Vol  Rev  Exp  EmpCnt  min_rank  max_rank  dense_rank
HCL       4.5  6.5  1.0     8.0       5.5       5.5         5.5
MRF       9.0  3.0  6.0     3.0       1.0       1.0         1.0
ISROACL   4.5  9.0  5.0     4.0       5.5       5.5         5.5
Reliance  1.0  1.0  7.0     6.0       9.0       9.0         9.0
BCCI      3.0  5.0  4.0     2.0       7.0       7.0         7.0
Birla     2.0  8.0  8.0     5.0       8.0       8.0         8.0
Flipkart  7.5  2.0  9.0     1.0       2.5       2.5         2.5
Apollo    7.5  6.5  2.0     7.0       2.5       2.5         2.5
IR        6.0  4.0  3.0     9.0       4.0       4.0         4.0

In [111]:
dd1 =df4.drop('Vol',axis=1)
dd1

          Rev  Exp Catg  EmpCnt   HQ  min_rank  max_rank  dense_rank
HCL       863  605  Pub    1935  NCR       5.0       6.0         4.0
MRF       821  665  Pub    1154  Che       1.0       1.0         1.0
ISROACL   881  650  Gov    1361  Blr       5.0       6.0         4.0
Reliance  217  674  Pub    1443  Mum       9.0       9.0         7.0
BCCI      839  615  Pvt     154  Mum       7.0       7.0         5.0
Birla     874  676  Pub    1379  Kol       8.0       8.0         6.0
Flipkart  805  695  Pvt     119  Blr       2.0       3.0         2.0
Apollo    863  608  Pub    1656  Che       2.0       3.0         2.0
IR        833  609  Gov   13023  NCR       4.0       4.0         3.0

In [112]:
dd1 =dd1.drop(index =['ISROACL','BCCI'],columns =['Exp','EmpCnt'])
dd1

          Rev Catg   HQ  min_rank  max_rank  dense_rank
HCL       863  Pub  NCR       5.0       6.0         4.0
MRF       821  Pub  Che       1.0       1.0         1.0
Reliance  217  Pub  Mum       9.0       9.0         7.0
Birla     874  Pub  Kol       8.0       8.0         6.0
Flipkart  805  Pvt  Blr       2.0       3.0         2.0
Apollo    863  Pub  Che       2.0       3.0         2.0
IR        833  Gov  NCR       4.0       4.0         3.0

### Ranking by Groups

In [113]:
df4

          Vol  Rev  Exp Catg  EmpCnt   HQ  min_rank  max_rank  dense_rank
HCL       931  863  605  Pub    1935  NCR       5.0       6.0         4.0
MRF       992  821  665  Pub    1154  Che       1.0       1.0         1.0
ISROACL   931  881  650  Gov    1361  Blr       5.0       6.0         4.0
Reliance  899  217  674  Pub    1443  Mum       9.0       9.0         7.0
BCCI      925  839  615  Pvt     154  Mum       7.0       7.0         5.0
Birla     900  874  676  Pub    1379  Kol       8.0       8.0         6.0
Flipkart  966  805  695  Pvt     119  Blr       2.0       3.0         2.0
Apollo    966  863  608  Pub    1656  Che       2.0       3.0         2.0
IR        954  833  609  Gov   13023  NCR       4.0       4.0         3.0

In [114]:
df4['Volrank'] =df4.groupby('Catg')['Vol'].rank()
df4

,Vol,Rev,Exp,Catg,EmpCnt,HQ,min_rank,max_rank,dense_rank,Volrank
HCL,931,863,605,Pub,1935,NCR,5.0,6.0,4.0,3.0
MRF,992,821,665,Pub,1154,Che,1.0,1.0,1.0,5.0
ISROACL,931,881,650,Gov,1361,Blr,5.0,6.0,4.0,1.0
Reliance,899,217,674,Pub,1443,Mum,9.0,9.0,7.0,1.0
BCCI,925,839,615,Pvt,154,Mum,7.0,7.0,5.0,1.0
Birla,900,874,676,Pub,1379,Kol,8.0,8.0,6.0,2.0
Flipkart,966,805,695,Pvt,119,Blr,2.0,3.0,2.0,2.0
Apollo,966,863,608,Pub,1656,Che,2.0,3.0,2.0,4.0
IR,954,833,609,Gov,13023,NCR,4.0,4.0,3.0,2.0

In [115]:
df4.groupby('Catg')['Vol'].rank()

HCL         3.0
MRF         5.0
ISROACL     1.0
Reliance    1.0
BCCI        1.0
Birla       2.0
Flipkart    2.0
Apollo      4.0
IR          2.0
Name: Vol, dtype: float64